hello_message = """
Привет, дорогой друг!
Выбери необходимую тебе функцию
"""

bet_message = """
Цель игры
Угадать на каком из 13 номеров остановится шарик. Выигрыш зависит от того, каким образом были сделаны ставки.

Ставки
Ставки в рулетке делятся на 9 типов. Каждая из них покрывает соответствующее количество номеров и имеет собственную шкалу выплат.

1. Ставка на номер - 11:1
2. Ставка на одну из трех комбинаций(1-6,4-9,7-12) - 1:1
3. Ставка на 🔴/⚫️ - 1:1
4. Ставка на EVEN/ODD (Четное/Нечетное) - 1:1

Результаты рулетки 100% случайны и честны.

Выберите поля для ставки
"""

bet_size_message = """
Введите размер вашей ставки

Минимальная ставка: 50
"""

finished_message = """
Ваша ставка принята!
"""

not_enough = """
Недостаточный баланс для такой ставки
"""

too_little_bet_size = """
Слишком маленькая ставка
Минимальный размер ставки: 50
"""

balance_message = """
Размер вашего баланса: %d

Приглашайте в игру своих друзей и знакомых, Вы будете получать 50 💎 сразу и 30% от каждого пополнения баланса приглашенным Вами человеком. Доход ни чем не ограничен.
Даже несколько приглашенных могут принести вам более 100 000 💎.
Ваша реферальная ссылка: %s
"""

end_game = """
Результаты игры:

Выпало число: %s

Ставка: %d
Поле: %s
Выигрыш: %d
"""

balance_plus = """
Пополнить баланс: ваш адрес для пополнения %s
"""

mnemonic_block_io = """
sadness tattoo affair outdoor afford afford senior stomach guilt memory segment version
"""

out_balance_message = """
Введите через пробел необходимую сумму и адрес для вывода
Минимальная сумма вывода денег: 1000
"""

too_little_out_amount = """
Слишком малый объем вывода
Минимальный объем вывода: 1000
"""

sent_money = """
Средства отправлены, транзакция пройдет в течение 1-3 часов
"""

not_enough_money = """
Недостаточный баланс для такого вывода
"""